[riscv@fedora-riscv ~]$ cd csc3054-primes/
[riscv@fedora-riscv csc3054-primes]$ gcc -lm -o bin/nprimes sources/nprimes.c
[riscv@fedora-riscv csc3054-primes]$ ./bin/nprimes 10

2, 3, 5, 7, 11, 13, 17, 19, 23, 29

Sum: 129

[riscv@fedora-riscv csc3054-primes]$ gcc -o bin/nprimes-jmath sources/nprimes-jmath.c
[riscv@fedora-riscv csc3054-primes]$ ./bin/nprimes-jmath 10

2, 3, 5, 7, 11, 13, 17, 19, 23, 29

Sum: 129

[riscv@fedora-riscv csc3054-primes]$ gcc -o bin/sum_primes assembly/sum_primes.s
[riscv@fedora-riscv csc3054-primes]$ gdb bin/sum_primes
GNU gdb (Fedora Linux) 14.2-1.fc40
Copyright (C) 2023 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "riscv64-redhat-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<https://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from bin/sum_primes...

This GDB supports auto-downloading debuginfo from the following URLs:
  <https://debuginfod.fedoraproject.org/>
Enable debuginfod for this session? (y or [n])
Debuginfod has been disabled.
To make this setting permanent, add 'set debuginfod enabled off' to .gdbinit.
(No debugging symbols found in bin/sum_primes)
(gdb) b exit
Breakpoint 1 at 0x11100
(gdb) run
Starting program: /home/riscv/csc3054-primes/bin/sum_primes
[Thread debugging using libthread_db enabled]
Using host libthread_db library "/lib64/lp64d/libthread_db.so.1".

Breakpoint 1.1, 0x0000000000011100 in exit ()
Missing separate debuginfos, use: dnf debuginfo-install glibc-2.39-13.fc40.riscv64
(gdb) info registers
ra             0x7ffff7e7767c	0x7ffff7e7767c <__libc_start_call_main+96>
sp             0x7ffffffff770	0x7ffffffff770
gp             0x14808	0x14808
tp             0x7ffff7fcf3a0	0x7ffff7fcf3a0
t0             0x81	129
t1             0x14008	81928
t2             0x0	0
fp             0x7ffffffff8a0	0x7ffffffff8a0
s1             0x7ffffffff908	140737488353544
a0             0x0	0
a1             0x7ffffffff908	140737488353544
a2             0x7ffffffff918	140737488353560
a3             0x0	0
a4             0x7ffffffff790	140737488353168
a5             0x11052	69714
a6             0x7ffff7fc7040	140737353904192
a7             0x5d	93
s2             0x1	1
s3             0x0	0
s4             0x13e10	81424
s5             0x11052	69714
s6             0x7ffffffff918	140737488353560
s7             0x13e10	81424
--Type <RET> for more, q to quit, c to continue without paging--[  295.589838] hrtimer: interrupt took 5690599 ns

s8             0x7ffff7ffdd48	140737354128712
s9             0x7ffff7ffe050	140737354129488
s10            0x5555556833a4	93824993473444
s11            0x5555555e8dc4	93824992841156
t3             0x1d	29
t4             0x7ffff7e5dc58	140737352424536
t5             0xffcbccd1cda0	281250779745696
t6             0x2e	46
pc             0x11100	0x11100 <exit+6>
(gdb) x /1w 0x14008
0x14008:	129
(gdb) q
A debugging session is active.

	Inferior 1 [process 865] will be killed.

Quit anyway? (y or n) y
[riscv@fedora-riscv csc3054-primes]$ gcc -o bin/counter assembly/counter.s
[riscv@fedora-riscv csc3054-primes]$ gdb bin/counter
GNU gdb (Fedora Linux) 14.2-1.fc40
Copyright (C) 2023 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "riscv64-redhat-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<https://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from bin/counter...

This GDB supports auto-downloading debuginfo from the following URLs:
  <https://debuginfod.fedoraproject.org/>
Enable debuginfod for this session? (y or [n])
Debuginfod has been disabled.
To make this setting permanent, add 'set debuginfod enabled off' to .gdbinit.
(No debugging symbols found in bin/counter)
(gdb) b exit
Breakpoint 1 at 0x110f8
(gdb) run
Starting program: /home/riscv/csc3054-primes/bin/counter
[Thread debugging using libthread_db enabled]
Using host libthread_db library "/lib64/lp64d/libthread_db.so.1".

Breakpoint 1.1, 0x00000000000110f8 in exit ()
Missing separate debuginfos, use: dnf debuginfo-install glibc-2.39-13.fc40.riscv64
(gdb) print $t0
$1 = 10
(gdb) print $t1
$2 = 0
(gdb) print (int)countup
$3 = 10
(gdb) q
A debugging session is active.

	Inferior 1 [process 907] will be killed.

Quit anyway? (y or n) y
[riscv@fedora-riscv csc3054-primes]$ uname -a
Linux fedora-riscv 6.8.7-300.4.riscv64.fc40.riscv64 #1 SMP PREEMPT_DYNAMIC Fri Apr 26 02:00:46 EDT 2024 riscv64 GNU/Linux
[riscv@fedora-riscv csc3054-primes]$
